#### Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

In [1]:
#Data Structures of pandas
#Series    =1d array
#Dataframe =2d array

In [2]:
import pandas as pd
#indexes will be automatically bassigned to series
data=pd.Series([1,2,3,4,5,6])
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [7]:
#Explicitly assign index to series 
data=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
data

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [8]:
data['b']

2

In [9]:
cardict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
car=pd.Series(cardict)
car

brand       Ford
model    Mustang
year        1964
dtype: object

In [10]:
car['model']

'Mustang'

In [11]:
car[1]

'Mustang'

In [14]:
#Adding
data=pd.Series([1,2,3,4,5,6])
data2=data + 8
data2

0     9
1    10
2    11
3    12
4    13
5    14
dtype: int64

In [17]:
#Filtering data
data=pd.Series([1,2,3,4,5,6])
data2=data[data>2]
data2

2    3
3    4
4    5
5    6
dtype: int64

### Combining Series with numpy

In [18]:
import pandas as pd
import numpy as np
arr=np.array([10,30,40,50,100,625])
print(arr)
s=pd.Series(arr)
print(s)
t=np.sqrt(s)
print(t)

[ 10  30  40  50 100 625]
0     10
1     30
2     40
3     50
4    100
5    625
dtype: int32
0     3.162278
1     5.477226
2     6.324555
3     7.071068
4    10.000000
5    25.000000
dtype: float64

In [21]:
arr=np.array([10,30,40,50,100,625])
indx=np.array(['a','b','c','d','e','f'])
s=pd.Series(arr,index=indx)
print(s)

a     10
b     30
c     40
d     50
e    100
f    625
dtype: int32

In [26]:
#Size
data=pd.Series([1,2,3,4,5,6])
print(data.size)

6

In [28]:
#mean,max,min in series
data=pd.Series([14,2,3,42,5,6])
print("Mean is ",data.mean())
print("Max val is ",data.max())
print("Min val is ",data.min())

Mean is  12.0
Max val is  42
Min val is  2

In [31]:
#Sort a series
data=pd.Series([14,233,3,42,5,6])
print("Before sorting is \n",data)
print("After sorting is \n",data.sort_values())

Before sorting is
 0     14
1    233
2      3
3     42
4      5
5      6
dtype: int64
After sorting is
 2      3
4      5
5      6
0     14
3     42
1    233
dtype: int64

In [33]:
#Unique values in series
data=pd.Series([10,23,12,10,65,23])
print("unique vals are \n",data.unique())

unique vals are
 [10 23 12 65]

In [34]:
#Count of unique
data=pd.Series([10,23,12,10,65,23])
print("Count of unique vals are \n",data.nunique())

Count of unique vals are
 4

In [35]:
#Summary of Series Statastics
data=pd.Series([10,23,12,10,65,23])
data.describe()

count     6.000000
mean     23.833333
std      21.065770
min      10.000000
25%      10.500000
50%      17.500000
75%      23.000000
max      65.000000
dtype: float64

### Dataframe

In [40]:
#Creating empty dataframe
import pandas as pd
data=pd.DataFrame()
data

Empty DataFrame
Columns: []
Index: []

In [41]:
#Creating dataframe from series
import pandas as pd
s=pd.Series(['a','b','c','d','e'])
data=pd.DataFrame(s)
data
# The zero displayed in top of result is the default column name

   0
0  a
1  b
2  c
3  d
4  e

In [44]:
name=pd.Series(['Rohit','Virat'])
team=pd.Series(['MI','RCB'])
dic={"Name":name,"Team":team}
df=pd.DataFrame(dic)
df

    Name Team
0  Rohit   MI
1  Virat  RCB

In [48]:
#Creating Dataframe from list of dictionaries
l=[{'Name':'Sachin','SirName':'Tendulkar'},
  {'Name':'Hardik','SirName':'Pandya'},
  {'Name':'Virat','SirName':'Kohli'}]
df=pd.DataFrame(l)
df

     Name    SirName
0  Sachin  Tendulkar
1  Hardik     Pandya
2   Virat      Kohli

In [4]:
#Dataframe Access using rowwise        =  iterrows()
l=[{'Name':'Sachin','SirName':'Tendulkar'},
  {'Name':'Hardik','SirName':'Pandya'},
  {'Name':'Virat','SirName':'Kohli'}]
df=pd.DataFrame(l)
df
for (row_index,row_value) in df.iterrows():
    print("Row index is ",row_index)
    print("Row value is \n",row_value)

Row index is  0
Row value is
 Name          Sachin
SirName    Tendulkar
Name: 0, dtype: object
Row index is  1
Row value is
 Name       Hardik
SirName    Pandya
Name: 1, dtype: object
Row index is  2
Row value is
 Name       Virat
SirName    Kohli
Name: 2, dtype: object

In [14]:
#Dataframe Access using columnwise        =items
l=[{'Name':'Sachin','SirName':'Tendulkar'},
  {'Name':'Hardik','SirName':'Pandya'},
  {'Name':'Virat','SirName':'Kohli'}]
df=pd.DataFrame(l)
print(df)
for (col_index,col_value) in df.items():
    print("Column index is : ",col_index)
    print("Column value is \n",col_value)

     Name    SirName
0  Sachin  Tendulkar
1  Hardik     Pandya
2   Virat      Kohli
Column index is :  Name
Column value is
 0    Sachin
1    Hardik
2     Virat
Name: Name, dtype: object
Column index is :  SirName
Column value is
 0    Tendulkar
1       Pandya
2        Kohli
Name: SirName, dtype: object

In [17]:
# Add, Rename and Delete Columns in a Dataframe
import pandas as pd
s=pd.Series([10,15,18,22 ])
df=pd.DataFrame(s)
df.columns=['List1']
df

   List1
0     10
1     15
2     18
3     22

In [18]:
df['List2']=20
df

   List1  List2
0     10     20
1     15     20
2     18     20
3     22     20

In [24]:
df['List3']=df['List1']+df['List2']
df

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

In [20]:
#delete column
del df['List3']
df

   List1  List2
0     10     20
1     15     20
2     18     20
3     22     20

In [25]:
df.pop('List3')
df

   List1  List2
0     10     20
1     15     20
2     18     20
3     22     20

In [27]:
#Deleting Rows and Colums using drop (columnwise)
df['List3']=df['List1']+df['List2']
print(df)
df1=df.drop('List2',axis=1)  # axis1 for column and axis0 for row
df1

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

   List1  List3
0     10     30
1     15     35
2     18     38
3     22     42

In [28]:
#deletion operation rowwise
df['List3']=df['List1']+df['List2']
print(df)
df1=df.drop(index=[2,3],axis=0)  # axis1 for column and axis0 for row
df1

   List1  List2  List3
0     10     20     30
1     15     20     35
2     18     20     38
3     22     20     42

   List1  List2  List3
0     10     20     30
1     15     20     35

In [ ]:
#Pandas DataFrame.loc attribute access a group of rows and columns by
#label(s) or a boolean array in the given Pandas DataFrame.

In [29]:
#Boolean indexing in Dataframes
import pandas as pd
dic ={'Name':['Sachin','Kohli','Hardik'],
     'Age' :[50,34,29]}
df=pd.DataFrame(dic,index=[True,False,True])
df

         Name  Age
True   Sachin   50
False   Kohli   34
True   Hardik   29

In [31]:
print(df.loc[True])

        Name  Age
True  Sachin   50
True  Hardik   29

In [32]:
print(df.loc[False])

Name    Kohli
Age        34
Name: False, dtype: object

In [35]:
#Concatination between DataFrames
dict1={'id':[10,18,7],
      'Name':['Sachin','Kohli','Dhoni']
      }
df1=pd.DataFrame(dict1)
dict2={'id':[45,42],
     'Name':['Rohit','Shikhar']
     }
df2=pd.DataFrame(dict2)
df3=pd.concat([df1,df2])
df3

   id     Name
0  10   Sachin
1  18    Kohli
2   7    Dhoni
0  45    Rohit
1  42  Shikhar